app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` LIMIT 5 OFFSET 0