app/controllers/users_controller.rb

  def show
    @posts = @user.posts.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM `posts` WHERE `posts`.`user_id` = 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 LIMIT 5 OFFSET 0

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('vishwaakash12', 'vishwaakash12@gmail.com', '$2a$12$SZUfUtVhm0mpMbNVCtKyiuMS8JnAKjjYKsun7qhkuVVINPS2w5vPe', '2021-12-10 14:12:58.031250', '2021-12-10 14:12:58.031250')